app/controllers/candidates_controller.rb

  def index
    @candidates = Candidate.all
---
SELECT * FROM "candidates"