app/controllers/contests_controller.rb

  def index
    @contests = Contest.all
---
SELECT * FROM "contests"