app/controllers/districts_controller.rb

  def index
    @districts = District.paginate(:per_page => 10, :page => params[:page])
---
SELECT * FROM "districts"