app/controllers/district_types_controller.rb

SELECT * FROM "district_types"
---
  def index
    @district_types = DistrictType.paginate(:per_page => 10, :page => params[:page])

INSERT INTO "district_types" ("updated_at", "title", "created_at") VALUES('2009-10-15 22:32:15', NULL, '2009-10-15 22:32:15')
---
  def create
    @district_type = DistrictType.new(params[:district_type])

    if @district_type.save