app/controllers/district_sets_controller.rb

  def index
    @district_sets = DistrictSet.all
---
SELECT * FROM "district_sets"

  def create
    @district_set = DistrictSet.new(params[:district_set])

    respond_to do |format|
      if @district_set.save
---
INSERT INTO "district_sets" ("updated_at", "display_name", "created_at") VALUES('2009-10-15 22:32:15', NULL, '2009-10-15 22:32:15')