app/controllers/elections_controller.rb

SELECT * FROM "elections" ORDER BY created_at DESC LIMIT 1
---
  def index
    @elections = Election.all

SELECT "candidates".* FROM "candidates" WHERE ("candidates".contest_id IN (15,10,23,11,4,12,16,1,8,17,18,5,14,3,26,24,31,7,21,28,19,25,9,22,6,30,20,13,27,217,2,29)) ORDER BY display_name
SELECT "contests".* FROM "contests" WHERE ("contests".election_id = 1) ORDER BY display_name
SELECT "districts".*, t0.district_set_id as the_parent_record_id FROM "districts" INNER JOIN "district_sets_districts" t0 ON "districts".id = t0.district_id WHERE (t0.district_set_id = 1)
SELECT "questions".* FROM "questions" WHERE ("questions".election_id = 1) ORDER BY display_name
---
  def show
    @election = Election.find(params[:id], :include => [
      { :district_set => :districts },
      { :contests => :candidates },
      :questions,
      ])