app/controllers/parties_controller.rb

  def index
    @parties = Party.all
---
SELECT * FROM "parties"

  def create
    @party = Party.new(params[:party])

    if @party.save
---
INSERT INTO "parties" ("updated_at", "display_name", "created_at") VALUES('2009-10-15 22:32:15', NULL, '2009-10-15 22:32:15')