app/controllers/precincts_controller.rb

  def index
    @precincts = Precinct.all
---
SELECT * FROM "precincts"

  def create
    @precinct = Precinct.new(params[:precinct])

    if @precinct.save
---
INSERT INTO "precincts" ("updated_at", "display_name", "created_at") VALUES('2009-10-15 22:32:15', NULL, '2009-10-15 22:32:15')