app/controllers/questions_controller.rb

SELECT * FROM "questions"
---
  def index
    @questions = Question.all