app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.paginate(:per_page => 10, :page => params[:page])