app/controllers/voting_methods_controller.rb

SELECT * FROM "voting_methods"
---
  def index
    @voting_methods = VotingMethod.all

INSERT INTO "voting_methods" ("updated_at", "display_name", "created_at") VALUES('2009-10-15 22:32:15', NULL, '2009-10-15 22:32:15')
---
  def create
    @voting_method = VotingMethod.new(params[:voting_method])

    if @voting_method.save